{"config": [{"config": {"trainable": true, "embeddings_constraint": null, "dtype": "float32", "output_dim": 100, "mask_zero": false, "embeddings_initializer": {"config": {"maxval": 0.05, "minval": -0.05, "seed": null}, "class_name": "RandomUniform"}, "embeddings_regularizer": null, "activity_regularizer": null, "input_length": null, "input_dim": 4938, "name": "embedding_1", "batch_input_shape": [null, 34]}, "class_name": "Embedding"}, {"config": {"activation": "relu", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "filters": 40, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "padding": "valid", "strides": [1], "dilation_rate": [1], "kernel_size": [5], "trainable": true, "activity_regularizer": null, "name": "conv1d_1"}, "class_name": "Conv1D"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_1"}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "global_max_pooling1d_1"}, "class_name": "GlobalMaxPooling1D"}, {"config": {"trainable": true, "rate": 0.3, "name": "dropout_2"}, "class_name": "Dropout"}, {"config": {"activation": "softmax", "use_bias": true, "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 3, "kernel_regularizer": null, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "trainable": true, "name": "dense_1"}, "class_name": "Dense"}], "backend": "theano", "class_name": "Sequential", "keras_version": "2.0.6"}